MadlyFX/openmv/ports/stm32/omv_csi.c
/*
 * Copyright (C) 2023-2024 OpenMV, LLC.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Any redistribution, use, or modification in source or binary form
 *    is done solely for personal benefit and not for any commercial
 *    purpose or for monetary gain. For commercial licensing options,
 *    please contact openmv@openmv.io
 *
 * THIS SOFTWARE IS PROVIDED BY THE LICENSOR AND COPYRIGHT OWNER "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE LICENSOR OR COPYRIGHT
 * OWNER BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
 * PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY
 * OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * STM32 CSI driver.
 */
#include <string.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include "py/mphal.h"
#include "irq.h"
#include "board_config.h"
#include "memcpy.h"
#include "omv_gpio.h"
#include "omv_i2c.h"
#include "omv_csi.h"
#include "stm_dma.h"
#include "stm_isp.h"
#include "stm_pwm.h"
#include "umalloc.h"

#if defined(DCMIPP)
#define USE_DCMIPP          (1)
// NOTE using PIPE1.
#define DCMIPP_PIPE         (DCMIPP_PIPE1)
#endif

#if defined(PSSI)
#define DCMI_IRQn           DCMI_PSSI_IRQn
#define DCMI_IRQHandler     DCMI_PSSI_IRQHandler
#define DMA_PRIORITY_HIGH   DMA_HIGH_PRIORITY
#endif

#if defined(OMV_MDMA_CHANNEL_DCMI_0)
#define USE_MDMA            (1)
#endif

#ifndef OMV_CSI_DMA_XFER_PORTS
#define OMV_CSI_DMA_XFER_PORTS  (0)
#endif

#ifndef OMV_CSI_DMA_MAX_SIZE
#define OMV_CSI_DMA_MAX_SIZE    (0xFFFFU)
#endif

#ifndef OMV_CSI_LINE_ALIGNMENT
#define OMV_CSI_LINE_ALIGNMENT  (16)
#endif

typedef enum {
    CSI_HANDLE_DCMI   = 0,
    CSI_HANDLE_DCMIPP = 1,
} csi_handle_t;

extern uint8_t _line_buf;
// Stores the CSI handle associated with DCMI/DCMIPP.
static omv_csi_t *stm_csi_all[2] = { 0 };

#if defined(STM32N6)
// Nodes can't be placed in CSI state because they need to be uncacheable.
static DMA_NodeTypeDef OMV_ATTR_SECTION(dma_nodes[2], ".dma_buffer");
#endif

void DCMI_IRQHandler(void) {
    omv_csi_t *csi = stm_csi_all[CSI_HANDLE_DCMI];
    HAL_DCMI_IRQHandler(&csi->dcmi);
}

#if USE_DCMIPP
void CSI_IRQHandler(void) {
    omv_csi_t *csi = stm_csi_all[CSI_HANDLE_DCMIPP];
    HAL_DCMIPP_CSI_IRQHandler(&csi->dcmipp);
}

void DCMIPP_IRQHandler(void) {
    omv_csi_t *csi = stm_csi_all[CSI_HANDLE_DCMIPP];
    HAL_DCMIPP_IRQHandler(&csi->dcmipp);
}
#endif

#if USE_MDMA
void omv_csi_mdma_irq_handler(void) {
    omv_csi_t *csi = stm_csi_all[CSI_HANDLE_DCMI];

    if (MDMA->GISR0 & (1 << OMV_MDMA_CHANNEL_DCMI_0)) {
        HAL_MDMA_IRQHandler(&csi->mdma0);
    }
    if (MDMA->GISR0 & (1 << OMV_MDMA_CHANNEL_DCMI_1)) {
        HAL_MDMA_IRQHandler(&csi->mdma1);
    }
}
#endif

static bool stm_csi_is_active(omv_csi_t *csi) {
    #if USE_DCMIPP
    if (csi->mipi_if) {
        return (DCMIPP->P1FCTCR & DCMIPP_P1FCTCR_CPTREQ) ||
               (DCMIPP->P0FCTCR & DCMIPP_P0FCTCR_CPTREQ);
    }
    #endif
    return (DCMI->CR & DCMI_CR_ENABLE);
}

int stm_csi_isp_reset(omv_csi_t *csi) {
    #if USE_DCMIPP
    if (csi->mipi_if) {
        return stm_isp_update_gamma_table(csi, DCMIPP_PIPE, 0.0f, 1.0f, 2.2f);
    }
    #endif // USE_DCMIPP
    return 0;
}

#if USE_DCMIPP && defined(STM32N6)
static void stm_csi_raw_window_free(omv_csi_t *csi) {
    if (csi->raw_window_buffer != NULL) {
        uma_free(csi->raw_window_buffer);
        csi->raw_window_buffer = NULL;
        csi->raw_window_buffer_size = 0;
    }
}

static int stm_csi_raw_window_alloc(omv_csi_t *csi, uint32_t size) {
    size = OMV_ALIGN_TO(size, OMV_CACHE_LINE_SIZE);

    if (csi->raw_window_buffer_size >= size) {
        return 0;
    }

    stm_csi_raw_window_free(csi);
    csi->raw_window_buffer = uma_malign(size, OMV_CACHE_LINE_SIZE, UMA_PERSIST | UMA_CACHE | UMA_MAYBE);

    if (csi->raw_window_buffer == NULL) {
        return OMV_CSI_ERROR_FRAMEBUFFER_ERROR;
    }

    csi->raw_window_buffer_size = size;
    return 0;
}

static int stm_csi_raw_window_config_pipe(omv_csi_t *csi) {
    if (csi->dcmipp.PipeState[DCMIPP_PIPE0] == HAL_DCMIPP_PIPE_STATE_BUSY) {
        return OMV_CSI_ERROR_CAPTURE_FAILED;
    }

    if ((csi->dcmipp.PipeState[DCMIPP_PIPE0] == HAL_DCMIPP_PIPE_STATE_RESET) ||
        (csi->dcmipp.PipeState[DCMIPP_PIPE0] == HAL_DCMIPP_PIPE_STATE_ERROR)) {
        DCMIPP_PipeConfTypeDef pcfg = {
            .FrameRate = DCMIPP_FRAME_RATE_ALL
        };

        if (HAL_DCMIPP_PIPE_SetConfig(&csi->dcmipp, DCMIPP_PIPE0, &pcfg) != HAL_OK) {
            return OMV_CSI_ERROR_CSI_INIT_FAILED;
        }
    }

    DCMIPP_CSI_PIPE_ConfTypeDef csi_pcfg = {
        .DataTypeMode = DCMIPP_DTMODE_DTIDA,
        .DataTypeIDA = DCMIPP_DT_RAW10,
        .DataTypeIDB = DCMIPP_DT_RAW10,
    };

    if (HAL_DCMIPP_CSI_PIPE_SetConfig(&csi->dcmipp, DCMIPP_PIPE0, &csi_pcfg) != HAL_OK) {
        return OMV_CSI_ERROR_CSI_INIT_FAILED;
    }

    return 0;
}

static uint8_t stm_csi_raw_window_pixel(uint16_t pixel, uint16_t low, uint16_t high) {
    if (pixel <= low) {
        return 0;
    }

    if (pixel >= high) {
        return UINT8_MAX;
    }

    uint32_t range = high - low;
    return ((pixel - low) * UINT8_MAX) / range;
}

static uint16_t stm_csi_raw10_window_sample(const uint16_t *row, uint32_t x) {
    // DCMIPP Pipe0 expands RAW10 to 16-bit words with the sample in bits 9:0.
    return row[x] & 0x03FF;
}

