MadlyFX/openmv/ports/stm32/omv_csi.c
static pixformat_t stm_csi_raw_window_bayer_pixfmt(omv_csi_t *csi, framebuffer_t *fb) {
    pixformat_t pixfmt = PIXFORMAT_BAYER_BGGR;

    if (csi->cfa_format == SUBFORMAT_ID_GBRG) {
        pixfmt = PIXFORMAT_BAYER_GBRG;
    } else if (csi->cfa_format == SUBFORMAT_ID_GRBG) {
        pixfmt = PIXFORMAT_BAYER_GRBG;
    } else if (csi->cfa_format == SUBFORMAT_ID_RGGB) {
        pixfmt = PIXFORMAT_BAYER_RGGB;
    }

    return imlib_bayer_shift(pixfmt, fb->x, fb->y, false);
}

static void stm_csi_raw10_window_to_8(const uint8_t *src, uint8_t *dst,
                                      uint32_t width, uint32_t height,
                                      uint32_t line_bytes, uint16_t low, uint16_t high) {
    for (uint32_t y = 0; y < height; y++) {
        const uint16_t *row = (const uint16_t *) (src + (y * line_bytes));
        uint8_t *out = dst + (y * width);

        for (uint32_t x = 0; x < width; x++) {
            out[x] = stm_csi_raw_window_pixel(stm_csi_raw10_window_sample(row, x), low, high);
        }
    }
}

static int stm_csi_raw_window_snapshot(omv_csi_t *csi, image_t *image, uint32_t flags) {
    framebuffer_t *fb = csi->fb;
    (void) flags;

    if ((csi->pixformat != PIXFORMAT_GRAYSCALE) &&
        (csi->pixformat != PIXFORMAT_BAYER)) {
        return OMV_CSI_ERROR_PIXFORMAT_UNSUPPORTED;
    }

    if (csi->transpose || csi->auto_rotation) {
        return OMV_CSI_ERROR_PIXFORMAT_UNSUPPORTED;
    }

    if ((!fb->u) || (!fb->v) || ((fb->x | fb->u) & 0x3)) {
        return OMV_CSI_ERROR_INVALID_FRAMESIZE;
    }

    if ((fb->u * fb->v) > framebuffer_get_buffer_size(fb)) {
        return OMV_CSI_ERROR_FRAMEBUFFER_OVERFLOW;
    }

    uint32_t line_bytes = fb->u * sizeof(uint16_t);
    uint32_t raw_size = line_bytes * fb->v;
    int ret = stm_csi_raw_window_alloc(csi, raw_size);
    if (ret != 0) {
        return ret;
    }

    vbuffer_t *buffer = framebuffer_acquire(fb, FB_FLAG_FREE | FB_FLAG_PEEK);
    if (buffer == NULL) {
        return OMV_CSI_ERROR_FRAMEBUFFER_ERROR;
    }

    if ((ret = stm_csi_raw_window_config_pipe(csi)) != 0) {
        return ret;
    }

    DCMIPP_CropConfTypeDef ccfg = {
        .HStart = fb->x,
        .VStart = fb->y,
        .HSize = fb->u,
        .VSize = fb->v,
        .PipeArea = DCMIPP_POSITIVE_AREA,
    };

    if ((HAL_DCMIPP_PIPE_SetCropConfig(&csi->dcmipp, DCMIPP_PIPE0, &ccfg) != HAL_OK) ||
        (HAL_DCMIPP_PIPE_EnableCrop(&csi->dcmipp, DCMIPP_PIPE0) != HAL_OK)) {
        return OMV_CSI_ERROR_CSI_INIT_FAILED;
    }

    csi->dcmipp.ErrorCode = HAL_DCMIPP_ERROR_NONE;
    csi->raw_window_done = false;
    csi->raw_window_error = false;
    csi->raw_window_active = true;

    #ifdef __DCACHE_PRESENT
    SCB_CleanInvalidateDCache_by_Addr(csi->raw_window_buffer, csi->raw_window_buffer_size);
    #endif

    if (HAL_DCMIPP_CSI_PIPE_Start(&csi->dcmipp, DCMIPP_PIPE0, DCMIPP_VIRTUAL_CHANNEL0,
                                  (uint32_t) csi->raw_window_buffer, DCMIPP_MODE_SNAPSHOT) != HAL_OK) {
        csi->raw_window_active = false;
        HAL_DCMIPP_PIPE_DisableCrop(&csi->dcmipp, DCMIPP_PIPE0);
        return OMV_CSI_ERROR_CAPTURE_FAILED;
    }

    for (mp_uint_t start = mp_hal_ticks_ms(); !csi->raw_window_done; mp_event_handle_nowait()) {
        if ((mp_hal_ticks_ms() - start) > OMV_CSI_TIMEOUT_MS) {
            ret = OMV_CSI_ERROR_CAPTURE_TIMEOUT;
            break;
        }
    }

    if (HAL_DCMIPP_CSI_PIPE_Stop(&csi->dcmipp, DCMIPP_PIPE0, DCMIPP_VIRTUAL_CHANNEL0) != HAL_OK) {
        ret = OMV_CSI_ERROR_CAPTURE_FAILED;
    }

    HAL_DCMIPP_PIPE_DisableCrop(&csi->dcmipp, DCMIPP_PIPE0);
    csi->raw_window_active = false;

    if (ret != 0) {
        return ret;
    }

    if (csi->raw_window_error) {
        return OMV_CSI_ERROR_CAPTURE_FAILED;
    }

    #ifdef __DCACHE_PRESENT
    SCB_InvalidateDCache_by_Addr(csi->raw_window_buffer, csi->raw_window_buffer_size);
    #endif

    stm_csi_raw10_window_to_8(csi->raw_window_buffer, buffer->data,
                              fb->u, fb->v, line_bytes,
                              csi->raw_window_low, csi->raw_window_high);

    fb->w = fb->u;
    fb->h = fb->v;
    fb->size = fb->w * fb->h;

    if (csi->pixformat == PIXFORMAT_BAYER) {
        fb->pixfmt = stm_csi_raw_window_bayer_pixfmt(csi, fb);
    } else {
        image_t src = {
            .w = fb->w,
            .h = fb->h,
            .pixfmt = stm_csi_raw_window_bayer_pixfmt(csi, fb),
            .data = buffer->data,
        };
        image_t dst = {
            .w = fb->w,
            .h = fb->h,
            .pixfmt = PIXFORMAT_GRAYSCALE,
            .data = csi->raw_window_buffer,
        };
        imlib_debayer_image(&dst, &src);
        memcpy(buffer->data, csi->raw_window_buffer, fb->size);
        fb->pixfmt = PIXFORMAT_GRAYSCALE;
    }

    // Release the buffer from free queue -> used queue.
    framebuffer_release(fb, FB_FLAG_FREE | FB_FLAG_CHECK_LAST);

    framebuffer_to_image(fb, image);
    return 0;
}
#endif  // USE_DCMIPP && defined(STM32N6)

static int stm_csi_config(omv_csi_t *csi, omv_csi_config_t config) {
    if (config == OMV_CSI_CONFIG_INIT) {
        if (!csi->mipi_if) {
            // Configure and initialize DMA.
            if (stm_dma_init(&csi->dma, OMV_CSI_DMA_CHANNEL, OMV_CSI_DMA_REQUEST,
                             DMA_PERIPH_TO_MEMORY, 4, 4, OMV_CSI_DMA_XFER_PORTS,
                             &stm_dma_csi_init, true)) {
                return OMV_CSI_ERROR_DMA_INIT_FAILED;
            }

            #if defined(STM32N6)
            // Initialize DMA in circular mode.
            if (stm_dma_ll_init(&csi->dma, &csi->dma_queue, dma_nodes,
                                OMV_ARRAY_SIZE(dma_nodes), OMV_CSI_DMA_LIST_PORTS)) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }
            #endif

            // Set DMA IRQ handle
            stm_dma_set_irq_descr(OMV_CSI_DMA_CHANNEL, &csi->dma);

            // Configure the DMA IRQ Channel
            csi->dma_irqn = stm_dma_channel_to_irqn(OMV_CSI_DMA_CHANNEL);
            NVIC_SetPriority(csi->dma_irqn, IRQ_PRI_DMA21);

            #if USE_MDMA
            csi->mdma0.Instance = MDMA_CHAN_TO_INSTANCE(OMV_MDMA_CHANNEL_DCMI_0);
            csi->mdma1.Instance = MDMA_CHAN_TO_INSTANCE(OMV_MDMA_CHANNEL_DCMI_1);
            #endif

            csi->dcmi.Instance = DCMI;
            csi->dcmi.Init.VSPolarity = csi->vsync_pol ? DCMI_VSPOLARITY_HIGH : DCMI_VSPOLARITY_LOW;
            csi->dcmi.Init.HSPolarity = csi->hsync_pol ? DCMI_HSPOLARITY_HIGH : DCMI_HSPOLARITY_LOW;
            csi->dcmi.Init.PCKPolarity = csi->pixck_pol ? DCMI_PCKPOLARITY_RISING : DCMI_PCKPOLARITY_FALLING;
            csi->dcmi.Init.SynchroMode = DCMI_SYNCHRO_HARDWARE;
            csi->dcmi.Init.CaptureRate = DCMI_CR_ALL_FRAME;
            csi->dcmi.Init.ExtendedDataMode = DCMI_EXTEND_DATA_8B;
            csi->dcmi.Init.JPEGMode = DCMI_JPEG_DISABLE;

            // Link the DMA handle to the DCMI handle
            __HAL_LINKDMA(&csi->dcmi, DMA_Handle, csi->dma);

            // Initialize the DCMI
            HAL_DCMI_DeInit(&csi->dcmi);
            if (HAL_DCMI_Init(&csi->dcmi) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            // Store CSI handle used for DCMI
            stm_csi_all[CSI_HANDLE_DCMI] = csi;

            // Configure and enable DCMI IRQ Channel
            NVIC_SetPriority(DCMI_IRQn, IRQ_PRI_DCMI);
            HAL_NVIC_EnableIRQ(DCMI_IRQn);
        } else {
            #if USE_DCMIPP
            // Initialize the DCMIPP
            csi->dcmipp.Instance = DCMIPP;

