MadlyFX/openmv/ports/stm32/omv_csi.c
            HAL_DCMIPP_DeInit(&csi->dcmipp);
            if (HAL_DCMIPP_Init(&csi->dcmipp) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            // Select and configure the DCMIPP source.
            DCMIPP_CSI_ConfTypeDef scfg = {
                .NumberOfLanes = DCMIPP_CSI_TWO_DATA_LANES,
                .DataLaneMapping = DCMIPP_CSI_PHYSICAL_DATA_LANES,
                .PHYBitrate = (csi->mipi_brate == 850) ? DCMIPP_CSI_PHY_BT_850 : DCMIPP_CSI_PHY_BT_1200,
            };

            if (HAL_DCMIPP_CSI_SetConfig(&csi->dcmipp, &scfg) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            // Configure CSI virtual channel and pipe.
            DCMIPP_CSI_PIPE_ConfTypeDef csi_pcfg = {
                .DataTypeMode = DCMIPP_DTMODE_DTIDA,
                .DataTypeIDA = DCMIPP_DT_RAW10,
                .DataTypeIDB = DCMIPP_DT_RAW10,
            };

            if (HAL_DCMIPP_CSI_SetVCConfig(&csi->dcmipp, DCMIPP_VIRTUAL_CHANNEL0,
                                           DCMIPP_CSI_DT_BPP10) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            if (HAL_DCMIPP_CSI_PIPE_SetConfig(&csi->dcmipp, DCMIPP_PIPE, &csi_pcfg) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            DCMIPP_PipeConfTypeDef dump_pcfg = {
                .FrameRate = DCMIPP_FRAME_RATE_ALL
            };

            if (HAL_DCMIPP_PIPE_SetConfig(&csi->dcmipp, DCMIPP_PIPE0, &dump_pcfg) != HAL_OK ||
                HAL_DCMIPP_CSI_PIPE_SetConfig(&csi->dcmipp, DCMIPP_PIPE0, &csi_pcfg) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            // Store CSI handle used for DCMIPP
            stm_csi_all[CSI_HANDLE_DCMIPP] = csi;

            // Configure and enable DCMI IRQ Channel
            NVIC_SetPriority(DCMIPP_IRQn, IRQ_PRI_DCMI);
            HAL_NVIC_EnableIRQ(DCMIPP_IRQn);

            // Configure and enable CSI IRQ Channel
            NVIC_SetPriority(CSI_IRQn, IRQ_PRI_DCMI);
            HAL_NVIC_EnableIRQ(CSI_IRQn);
            #endif
        }
    } else if (config == OMV_CSI_CONFIG_DEINIT) {
        if (!csi->mipi_if) {
            HAL_NVIC_DisableIRQ(DCMI_IRQn);
            HAL_DCMI_DeInit(&csi->dcmi);
        } else {
            #if USE_DCMIPP
            HAL_NVIC_DisableIRQ(DCMIPP_IRQn);
            HAL_DCMIPP_DeInit(&csi->dcmipp);
            #if defined(STM32N6)
            stm_csi_raw_window_free(csi);
            #endif
            #endif
        }
    } else if (config == OMV_CSI_CONFIG_PIXFORMAT) {
        if (!csi->mipi_if) {
            DCMI->CR &= ~(DCMI_CR_JPEG_Msk << DCMI_CR_JPEG_Pos);
            DCMI->CR |= (csi->pixformat == PIXFORMAT_JPEG) ? DCMI_JPEG_ENABLE : DCMI_JPEG_DISABLE;
            #if defined(STM32N6)
            // Handle YUV422 Source -> Y Destination using DCMI byte drop.
            if (csi->pixformat == PIXFORMAT_GRAYSCALE && csi->mono_bpp == 2) {
                DCMI->CR |= DCMI_CR_BSM_0;
            } else {
                DCMI->CR &= ~DCMI_CR_BSM_0;
            }

            // Turn on/off byte swapping for RGB/YUV formats.
            for (size_t i = 0; i < OMV_ARRAY_SIZE(dma_nodes); i++) {
                if ((csi->pixformat == PIXFORMAT_RGB565 && csi->rgb_swap) ||
                    (csi->pixformat == PIXFORMAT_YUV422 && csi->yuv_swap)) {
                    dma_nodes[i].LinkRegisters[NODE_CTR1_DEFAULT_OFFSET] |= DMA_CTR1_DBX;
                } else {
                    dma_nodes[i].LinkRegisters[NODE_CTR1_DEFAULT_OFFSET] &= ~DMA_CTR1_DBX;
                }
            }
            #endif
        } else {
            #if USE_DCMIPP
            csi->dcmipp.State = HAL_DCMIPP_STATE_READY;
            // Reset pipes states to allow reconfiguring them.
            for (size_t i = 0; i < DCMIPP_NUM_OF_PIPES; i++) {
                csi->dcmipp.PipeState[i] = HAL_DCMIPP_PIPE_STATE_RESET;
            }
            // Configure the pixel processing pipeline.
            if (stm_isp_init(csi, DCMIPP_PIPE, csi->pixformat, csi->raw_output)) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }
            #endif
        }
    } else if (config == OMV_CSI_CONFIG_RAW_WINDOW) {
        #if USE_DCMIPP && defined(STM32N6)
        if (!csi->raw_window_enabled) {
            stm_csi_raw_window_free(csi);
        }
        #endif
    }

    return 0;
}

// Stop the DCMI from generating more DMA requests, and disable the DMA.
static int stm_csi_abort(omv_csi_t *csi, bool fifo_flush, bool in_irq) {
    #if USE_DCMIPP && defined(STM32N6)
    if (csi->mipi_if && csi->raw_window_active) {
        HAL_DCMIPP_CSI_PIPE_Stop(&csi->dcmipp, DCMIPP_PIPE0, DCMIPP_VIRTUAL_CHANNEL0);
        HAL_DCMIPP_PIPE_DisableCrop(&csi->dcmipp, DCMIPP_PIPE0);
        csi->raw_window_active = false;
        csi->raw_window_done = false;
        csi->raw_window_error = false;
    }
    #endif

    if (!stm_csi_is_active(csi)) {
        return 0;
    }

    if (!csi->mipi_if) {
        DCMI->CR &= ~DCMI_CR_ENABLE;
        while (DCMI->CR & DCMI_CR_ENABLE) {
            ;
        }

        #if defined(STM32N6)
        HAL_DMA_Abort(&csi->dma);
        #else
        if (in_irq) {
            HAL_DMA_Abort_IT(&csi->dma);
        } else {
            HAL_DMA_Abort(&csi->dma);
        }
        #endif
        HAL_NVIC_DisableIRQ(csi->dma_irqn);

        #if USE_MDMA
        if (!in_irq) {
            HAL_MDMA_Abort(&csi->mdma0);
            HAL_MDMA_Abort(&csi->mdma1);
        }
        HAL_MDMA_DeInit(&csi->mdma0);
        HAL_MDMA_DeInit(&csi->mdma1);
        #endif

        __HAL_DCMI_DISABLE_IT(&csi->dcmi, DCMI_IT_FRAME);
        __HAL_DCMI_CLEAR_FLAG(&csi->dcmi, DCMI_FLAG_FRAMERI);
    } else {
        #if USE_DCMIPP
        HAL_DCMIPP_CSI_PIPE_Stop(&csi->dcmipp, DCMIPP_PIPE, DCMIPP_VIRTUAL_CHANNEL0);
        #endif // USE_DCMIPP
    }
    return 0;
}

static int stm_csi_shutdown(omv_csi_t *csi, int enable) {
    int ret = 0;
    if (enable) {
        ret = omv_csi_config(csi, OMV_CSI_CONFIG_DEINIT);
    } else {
        ret = omv_csi_config(csi, OMV_CSI_CONFIG_INIT);
    }
    return ret;
}

