MadlyFX/openmv/ports/stm32/omv_csi.c
static uint32_t stm_clk_get_frequency(omv_clk_t *clk) {
    if (!clk->tim.Instance) {
        return 0;
    }
    return stm_pwm_get_frequency(&clk->tim, OMV_CSI_TIM_CHANNEL);
}

static int stm_clk_set_frequency(omv_clk_t *clk, uint32_t frequency) {
    #if (OMV_CSI_CLK_SOURCE == OMV_CSI_CLK_SOURCE_MCO)
    // Pass through the MCO1 clock with source input set to HSE (12MHz).
    // Note MCO1 is multiplexed on OPENMV2/TIM1 only.
    HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_HSE, RCC_MCODIV_1);
    #elif (OMV_CSI_CLK_SOURCE == OMV_CSI_CLK_SOURCE_OSC)
    // An external oscillator is used for the csi clock.
    // Configure and enable external oscillator if needed.
    #elif (OMV_CSI_CLK_SOURCE == OMV_CSI_CLK_SOURCE_TIM)
    if (stm_pwm_start(&clk->tim, OMV_CSI_TIM, OMV_CSI_TIM_CHANNEL, frequency)) {
        return OMV_CSI_ERROR_TIM_INIT_FAILED;
    }
    #else
    #error "OMV_CSI_CLK_SOURCE is not set!"
    #endif // (OMV_CSI_CLK_SOURCE == OMV_CSI_CLK_SOURCE_TIM)
    return 0;
}

int omv_csi_set_vsync_callback(omv_csi_t *csi, omv_csi_cb_t cb) {
    if (cb.fun == NULL) {
        #if (DCMI_VSYNC_EXTI_SHARED == 0)
        // Disable VSYNC EXTI IRQ
        omv_gpio_irq_enable(OMV_CSI_VSYNC_PIN, false);
        #endif
    } else {
        // Enable VSYNC EXTI IRQ
        omv_gpio_irq_register(OMV_CSI_VSYNC_PIN, cb.fun, cb.arg);
        omv_gpio_irq_enable(OMV_CSI_VSYNC_PIN, true);
    }
    return 0;
}

// If the image is cropped by more than 1 word in width, align the line start to a word
// address to improve copy performance. Do not crop by more than 1 word as this will
// result in less time between DMA transfers complete interrupts on 16-byte boundaries.
static uint32_t get_dcmi_hw_crop(omv_csi_t *csi, uint32_t bytes_per_pixel) {
    framebuffer_t *fb = csi->fb;
    uint32_t byte_x_offset = (fb->x * bytes_per_pixel) % 4;
    uint32_t width_remainder = (csi->resolution[csi->framesize][0] - (fb->x + fb->u)) * bytes_per_pixel;

    if (byte_x_offset && (width_remainder >= (4 - byte_x_offset))) {
        return byte_x_offset;
    }

    return 0;
}

static void stm_csi_frame_event(omv_csi_t *csi, uint32_t pipe) {
    framebuffer_t *fb = csi->fb;

    #if USE_MDMA
    // Clear out any stale flags.
    DMA2->LIFCR = DMA_FLAG_TCIF1_5 | DMA_FLAG_HTIF1_5;
    // Re-enable the DMA IRQ to catch the next start line.
    HAL_NVIC_EnableIRQ(csi->dma_irqn);
    #endif

    // The ISP AWB stats lag by one frame. So, drop the first frame when not initialized.
    #if defined(OMV_CSI_STATS_ENABLE)
    if (csi->raw_output && csi->stats_enabled && !csi->stats.initialized) {
        stm_isp_update_awb(csi, DCMIPP_PIPE, fb->u * fb->v);
        csi->drop_frame = true;
    }
    #endif // OMV_CSI_STATS_ENABLE

    csi->first_line = false;
    if (csi->drop_frame) {
        csi->drop_frame = false;
        // Reset the buffer's state if the frame was dropped.
        vbuffer_t *buffer = framebuffer_acquire(fb, FB_FLAG_FREE | FB_FLAG_PEEK);
        framebuffer_reset(buffer);
        return;
    }

    // Release the buffer from free queue -> used queue.
    framebuffer_release(fb, FB_FLAG_FREE | FB_FLAG_CHECK_LAST);

    if (csi->frame_cb.fun) {
        csi->frame_cb.fun(csi->frame_cb.arg);
    }

    #if defined(STM32N6)
    // Acquire a buffer from the free queue.
    vbuffer_t *buffer = framebuffer_acquire(fb, FB_FLAG_FREE | FB_FLAG_PEEK);

    if (buffer == NULL && csi->recorder_active && csi->recorder_drop_frames) {
        if (framebuffer_release(fb, FB_FLAG_USED | FB_FLAG_INVALIDATE)) {
            csi->recorder_dropped_frames++;
            buffer = framebuffer_acquire(fb, FB_FLAG_FREE | FB_FLAG_PEEK);
        }
    }

    if (buffer == NULL) {
        omv_csi_abort(csi, false, false);
    } else if (csi->mipi_if) {
        HAL_DCMIPP_PIPE_SetMemoryAddress(&csi->dcmipp, pipe,
                                         DCMIPP_MEMORY_ADDRESS_0, (uint32_t) buffer->data);
    } else if (csi->one_shot) {
        HAL_DCMI_Stop(&csi->dcmi);
        HAL_DCMI_Start_DMA(&csi->dcmi, DCMI_MODE_SNAPSHOT, (uint32_t) buffer->data, csi->dma_size);
    }
    #endif  // STM32N6
}

void HAL_DCMI_FrameEventCallback(DCMI_HandleTypeDef *hdcmi) {
    stm_csi_frame_event(OMV_CONTAINER_OF(hdcmi, omv_csi_t, dcmi), 0);
}

#if USE_DCMIPP
void HAL_DCMIPP_PIPE_FrameEventCallback(DCMIPP_HandleTypeDef *hdcmi, uint32_t pipe) {
    omv_csi_t *csi = OMV_CONTAINER_OF(hdcmi, omv_csi_t, dcmipp);

    #if defined(STM32N6)
    if ((pipe == DCMIPP_PIPE0) && csi->raw_window_active) {
        csi->raw_window_done = true;
        return;
    }
    #endif

    stm_csi_frame_event(csi, pipe);
}

void HAL_DCMIPP_PIPE_ErrorCallback(DCMIPP_HandleTypeDef *hdcmi, uint32_t pipe) {
    #if defined(STM32N6)
    omv_csi_t *csi = OMV_CONTAINER_OF(hdcmi, omv_csi_t, dcmipp);

    if ((pipe == DCMIPP_PIPE0) && csi->raw_window_active) {
        csi->raw_window_error = true;
        csi->raw_window_done = true;
    }
    #else
    (void) hdcmi;
    (void) pipe;
    #endif
}
#endif

#if defined(STM32F4) || defined(STM32F7) || defined(STM32H7)
// This function is called after each transfer is complete,
// with a pointer to the buffer that was used.
void DCMI_DMAConvCpltUser(DCMI_HandleTypeDef *hdcmi, uint32_t addr) {
    omv_csi_t *csi = OMV_CONTAINER_OF(hdcmi, omv_csi_t, dcmi);
    framebuffer_t *fb = csi->fb;

    // Throttle frames to match the current frame rate.
    omv_csi_throttle_framerate(csi);

    if (csi->drop_frame) {
        #if USE_MDMA
        if (!csi->transpose && csi->pixformat != PIXFORMAT_JPEG) {
            HAL_NVIC_DisableIRQ(csi->dma_irqn);
        }
        #endif
        return;
    }

    // Acquire a buffer from the free queue.
    vbuffer_t *buffer = framebuffer_acquire(fb, FB_FLAG_FREE | FB_FLAG_PEEK);
    if (buffer == NULL) {
        omv_csi_abort(csi, false, true);
        return;
    }

    if (csi->pixformat == PIXFORMAT_JPEG) {
        if (csi->jpg_format == 3) {
            // JPEG MODE 3: Variable line width per frame, with the last line
            // potentially shorter and no padding. `offset` is incremented once
            // every max transfer, and the DMA counter holds the total size.
            buffer->offset += 1;
        } else if (csi->jpg_format == 4) {
            // JPEG MODE 4: Fixed width and height per frame. Each line starts
            // with two bytes indicating valid data length, followed by image
            // data and optional padding (0xFF). `offset` holds the total size.
            uint16_t size = __REV16(*((uint16_t *) addr));
            if (buffer->offset + size > framebuffer_get_buffer_size(fb)) {
                buffer->flags |= VB_FLAG_OVERFLOW;
                return;
            }
            unaligned_memcpy(buffer->data + buffer->offset, ((uint16_t *) addr) + 1, size);
            buffer->offset += size;
        }
        return;
    }

    #if USE_MDMA
    // DCMI_DMAConvCpltUser is called with the other MAR register.
    // So, we have to fix the address in full MDMA offload mode.
    if (!csi->transpose) {
        addr = (uint32_t) &_line_buf;
    }
    #endif

    uint32_t bytes_per_pixel = omv_csi_get_src_bpp(csi);
    uint8_t *src = ((uint8_t *) addr) + (fb->x * bytes_per_pixel) - get_dcmi_hw_crop(csi, bytes_per_pixel);
    uint8_t *dst = buffer->data;

