MadlyFX/openmv/ports/stm32/omv_csi.c
        if ((mp_hal_ticks_ms() - start) > OMV_CSI_TIMEOUT_MS) {
            omv_csi_abort(csi, true, false);
            return OMV_CSI_ERROR_CAPTURE_TIMEOUT;
        }
    }

    // In JPEG 3 mode, the transfer must be aborted as it waits for data indefinitely.
    if (!csi->mipi_if && (csi->pixformat == PIXFORMAT_JPEG) && (csi->jpg_format == 3)) {
        omv_csi_abort(csi, false, false);
    }

    // The JPEG in the framebuffer is actually invalid.
    if (buffer->flags & VB_FLAG_OVERFLOW) {
        return OMV_CSI_ERROR_JPEG_OVERFLOW;
    }

    // Set the framebuffer width/height.
    fb->w = csi->transpose ? fb->v : fb->u;
    fb->h = csi->transpose ? fb->u : fb->v;

    // Set the framebuffer pixel format.
    switch (csi->pixformat) {
        case PIXFORMAT_GRAYSCALE:
            fb->pixfmt = PIXFORMAT_GRAYSCALE;
            break;
        case PIXFORMAT_RGB565:
            fb->pixfmt = PIXFORMAT_RGB565;
            break;
        case PIXFORMAT_BAYER:
            fb->pixfmt = PIXFORMAT_BAYER;
            fb->subfmt_id = csi->cfa_format;
            fb->pixfmt = imlib_bayer_shift(fb->pixfmt, fb->x, fb->y, csi->transpose);
            break;
        case PIXFORMAT_YUV422: {
            fb->pixfmt = PIXFORMAT_YUV;
            fb->subfmt_id = csi->yuv_format;
            fb->pixfmt = imlib_yuv_shift(fb->pixfmt, fb->x);
            break;
        }
        case PIXFORMAT_JPEG: {
            int32_t size = 0;
            if (csi->jpg_format == 4) {
                // Offset is the total frame size.
                size = buffer->offset;
            } else {
                // HAL_DCMI_Start_DMA splits bigger transfers.
                if (csi->dma_size > OMV_CSI_DMA_MAX_SIZE) {
                    csi->dma_size /= 2;
                }

                // Offset is the number of length-size transfers performed.
                size = buffer->offset * csi->dma_size * 4;
                // The DMA counter holds the number of bytes per transfer.
                if (!csi->mipi_if && __HAL_DMA_GET_COUNTER(&csi->dma)) {
                    // Add in the uncompleted transfer length.
                    size += (csi->dma_size - __HAL_DMA_GET_COUNTER(&csi->dma)) * 4;
                }
            }
            // Clean trailing data after 0xFFD9 at the end of the jpeg byte stream.
            fb->pixfmt = PIXFORMAT_JPEG;
            fb->size = jpeg_clean_trailing_bytes(size, buffer->data);
            break;
        }
        default:
            break;
    }

    #if USE_DCMIPP
    if (csi->raw_output) {
        float luminance = stm_isp_update_awb(csi, DCMIPP_PIPE, fb->u * fb->v);
        if (csi->ioctl) {
            omv_csi_ioctl(csi, OMV_CSI_IOCTL_UPDATE_AGC_AEC, fast_floorf(luminance));
        }

    }
    #endif

    // Set the user image.
    framebuffer_to_image(fb, image);
    return 0;
}

int omv_csi_ops_init(omv_csi_t *csi) {
    // Set CSI ops.
    csi->abort = stm_csi_abort;
    csi->config = stm_csi_config;
    csi->shutdown = stm_csi_shutdown;
    csi->snapshot = stm_csi_snapshot;
    csi->isp_reset = stm_csi_isp_reset;

    // Set CSI clock ops.
    csi->clk->freq = OMV_CSI_CLK_FREQUENCY;
    csi->clk->set_freq = stm_clk_set_frequency;
    csi->clk->get_freq = stm_clk_get_frequency;
    return 0;
}
